import random

name_list = [
    '龚晴怡', '熊家豪', '陈熙', '郑多多', '吴俊杰', '粱申奥', '张悦', '王梦媛', '万琬婷', '梅筱鹏', '贾雨菲',
    '张孜豪', '赵家瑶', '陈嘉轩', '龚福康', '郑高涵', '郑家昊', '樊玉玲', '何佳怡', '邓诗涵', '赵程旭',
    '石梦瑶', '房奥辉', '朱思雨', '闫瑞欣', '宋婉婷', '赵佳茹', '李嘉诚', '李冠衡', '董文慧', '任琪美',
    '梅思怡', '马佳俊', '唐甜', '李思涵', '黄子祥', '郭奥冉', '彭春晓', '韩豪强', '狄庆茹', '黄文龙', '杨超然',
    '王文杰', '吴文波', '梅愉', '李宇浩', '李雯慧', '金易', '薛冬平', '王梦雪', '崔宇恒', '宋雨停', '牛祥祥',
    '时家琦', '闫旭', '李婧婧', '李平', '孙璨璨', '魏弋翔', '杜玥瑶', '吴翔', '赵雨函', '邢奥庆', '周旭成',
    '时锦艳', '徐慧', '徐泽', '李鑫鑫', '韦朝阳', '耿强', '梅丹阳', '万瑜涛', '张欣欣', '高梅婷', '梅泽涛',
    '梅依晨', '张双军', '赵强', '李宁', '罗豪', '杨慧琳'
]


def call_name():
    num = random.randint(0, 80)
    print(name_list[num])


xing = 30 * "*"
print(xing)
print("         746点名系统        ")
print(xing)

start = int(input("\n\n请输入0开始点名："))

if start == 0:
    flag = True
    while flag:
        print("开始点名：", end="")
        call_name()
        duandian = int(input("1 继续点名，2 退出系统\n请输入："))
        if duandian == 1:
            pass
        else:
            break
